In [15]:
import pandas as pd

# drop rows with missing values

In [16]:
data={'name':['prijal', 'aayush', 'nishant', 'aarogya'],
      'age':[21,22,None,24]}
df=pd.DataFrame(data)
df

      name   age
0   prijal  21.0
1   aayush  22.0
2  nishant   NaN
3  aarogya  24.0

In [17]:
new_df=df.dropna()
new_df

      name   age
0   prijal  21.0
1   aayush  22.0
3  aarogya  24.0

# filling values

In [18]:
df['age']=df['age'].fillna(23)
df

      name   age
0   prijal  21.0
1   aayush  22.0
2  nishant  23.0
3  aarogya  24.0

## finding duplicate rows

In [24]:
data1={'name':['ram', 'santosh', 'hari', 'santosh'],
       'age':[21,23,21,24],
       'city':['ktm','bhktpur','ktm', 'lalitpur']}
df1=pd.DataFrame(data1)

df1

      name  age      city
0      ram   21       ktm
1  santosh   23   bhktpur
2     hari   21       ktm
3  santosh   24  lalitpur

In [28]:
## checking for duplicates
duplicates = df.duplicated()

df1['Is_duplicate']=duplicates
df1

      name  age      city  Is_duplicate
0      ram   21       ktm         False
1  santosh   23   bhktpur         False
2     hari   21       ktm         False
3  santosh   24  lalitpur         False

In [30]:
df1.value_counts().sum()

4

In [33]:
new_df1=df1['name'].unique()
new_df1

array(['ram', 'santosh', 'hari'], dtype=object)